In [2]:
#import #  
import time
from selenium import webdriver
# import chrome in webdriver
from selenium.webdriver import Chrome
#import pandas 
import pandas as pd
#import selenium webdriver webdriver
from selenium.webdriver.common.keys import Keys as key
import warnings
warnings.filterwarnings('ignore')

# Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. Youhave to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data.
    This task will be done in following steps:
    1. First get the webpage https://www.naukri.com/
    2. Enter “Data Analyst” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the
    location” field.
    3. Then click the search button.
    4. Then scrape the data for the first 10 jobs results you get.
    5. Finally create a dataframe of the scraped data.

In [3]:
from selenium import webdriver
import pandas as pd

In [112]:
doc = webdriver.Chrome(executable_path='chromedriver.exe')
doc.get('https://www.naukri.com/')
doc.maximize_window()

# 2. Enter “Data Analyst” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the location” field.

In [113]:
#enter Data Analyst using calss
doc.find_element_by_class_name("sugInp").send_keys('Data Analyst')

In [114]:
#enter bangalore in location
doc.find_element_by_id("qsb-location-sugg").send_keys('Bangalore')

# 3. Then click the search button`

In [115]:
# click on search button
doc.find_element_by_class_name('btn').click()

# 4. Then scrape the data for the first 10 jobs results you get.

In [117]:
#create 5 blank list variable
designation = []
company_name = []
exp = []
location=[]

#for_loop run 10 times
for i in range(1,11):
    #using xpath scrape data thnen uses loop xpath run 10 time or scrape 1st 10 data
    designation.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/a').text)
    company_name.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/div/a[1]').text)
    exp.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/ul/li[1]/span').text)
    location.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/ul/li[3]/span').text)
    
print('successful scrap')

successful scrap

# 5. Finally create a dataframe of the scraped data.

In [118]:
#create data frame using pandas
pd.DataFrame({'Job title':designation,'Company Name':company_name,'Experience required':exp,'Location':location})

,Job title,Company Name,Experience required,Location
0,Lead - Data Analyst / Scientist,Axim Technologies,12-14 Yrs,Bangalore/Bengaluru
1,Senior Data Analyst,Schneider Electric,0-2 Yrs,Bangalore/Bengaluru
2,Data Analyst,Snaphunt,0-2 Yrs,Bangalore/Bengaluru
3,Business Data Analyst - Database Design/Mining,AugmatrixGo,2-5 Yrs,Bangalore/Bengaluru
4,Senior Data Analyst - KPO,Huquo Consulting Pvt. Ltd,7-12 Yrs,"Gurgaon/Gurugram, Bangalore/Bengaluru"
5,Senior Data Analyst - Supporting Audits,Visa,5-8 Yrs,Bangalore/Bengaluru
6,Data Analyst,Flipkart,1-2 Yrs,Bengaluru/Bangalore
7,Senior Data Analyst,Glance,1-6 Yrs,Bangalore/Bengaluru
8,Senior Data Analyst,Glance IT Solution,1-6 Yrs,Bangalore/Bengaluru
9,Senior Data Analyst,Arcworth Strategy LLP,2-4 Yrs,Remote

# Q2: Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data. This task will be done in following steps:
    1. First get the webpage https://www.naukri.com/
    2. Enter “Data Scientist” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the
    location” field.
    3. Then click the search button.
    4. Then scrape the data for the first 10 jobs results you get.
    5. Finally create a dataframe of the scraped data.

# 1. First get the webpage https://www.naukri.com/

In [10]:
doc = webdriver.Chrome(executable_path='chromedriver.exe')
doc.get('https://www.naukri.com/')
doc.maximize_window()

# 2. Enter “Data Scientist” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the location” field.

In [11]:
#enter Data Scientist using calss
doc.find_element_by_class_name("sugInp").send_keys('Data Scientist')

In [12]:
#enter bangalore in location
doc.find_element_by_id("qsb-location-sugg").send_keys('Bangalore')

# 3. Then click the search button.

In [13]:
# click on search button
doc.find_element_by_class_name('btn').click()

In [16]:
#create 5 blank list variable
designation = []
company_name = []
location=[]

#for_loop run 10 times
for i in range(1,11):
    #using xpath scrape data thnen uses loop xpath run 10 time or scrape 1st 10 data
    designation.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/a').text)
    company_name.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/div/a[1]').text)
    location.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/ul/li[3]/span').text)
    
print('successful scrap')

successful scrap

# 5. Finally create a dataframe of the scraped data

In [17]:
#create data frame using pandas
pd.DataFrame({'Job title':designation,'Company Name':company_name,'Location':location})

,Job title,Company Name,Location
0,Global Tax Automation & Operations | Data Scie...,Dell,Bangalore/Bengaluru
1,Senior Data Scientist,Fractal Analytics,"Gurgaon/Gurugram, Bangalore/Bengaluru, Mumbai ..."
2,Lead - Data Analyst / Scientist,Axim Technologies,Bangalore/Bengaluru
3,Job opening with Wipro For Data Scientist,Wipro,"Hyderabad/Secunderabad, Pune, Chennai, Bangalo..."
4,Data Scientist I,Delhivery,Bangalore/Bengaluru
5,Spark ML Data Scientist,Wipro,"Hyderabad/Secunderabad, Pune, Bangalore/Bengaluru"
6,Spark ML Data Scientist,Wipro,"Hyderabad/Secunderabad, Pune, Bangalore/Bengaluru"
7,Azure ML Data Scientist,TCS,"Hyderabad/Secunderabad, Bangalore/Bengaluru"
8,Senior Data Scientist,Greenizon Agritech Consultancy,Bangalore/Bengaluru
9,Data Scientist,Diverse Lynx,Bangalore/Bengaluru

# Q3: In this question you have to scrape data using the filters available on the webpage as shown below:
    You have to use the location and salary filter.
    You have to scrape data for “Data Scientist” designation for first 10 job results.
    You have to scrape the job-title, job-location, company name, experience required.
    The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs
    The task will be done as shown in the below steps:
    1. first get the webpage https://www.naukri.com/
    2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.
    3. Then click the search button.
    4. Then apply the location filter and salary filter by checking the respective boxes
    5. Then scrape the data for the first 10 jobs results you get.
    6. Finally create a dataframe of the scraped data.
    Note: All of the above steps have to be done in code. No step is to be done manually.

In [18]:
#create variable and add path chromedrive path
    # doc = Chrome(executable_path='C:\chromedriver.exe')

#upload chrome driver in jupiter notebook then use 
doc = Chrome("chromedriver.exe")
#open webpage
#maximize window
doc.maximize_window()
#open chrome
url = 'https://www.naukri.com/'
doc.get(url)

# 2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.

In [19]:
#enter data scientist using class
doc.find_element_by_class_name('sugInp').send_keys('Data Scientist')

# 3. Then click the search button.¶

In [20]:
#click search button
doc.find_element_by_class_name('btn').click()

# 4. Then apply the location filter and salary filter by checking the respective boxes

In [21]:
#click location filter using css selector
doc.find_element_by_css_selector('[Title="Delhi / NCR"]').click()
# wait 3 sec
time.sleep(5)
#click salary filter using css selector
doc.find_element_by_css_selector('[Title="3-6 Lakhs"]').click()

# 5. Then scrape the data for the first 10 jobs results you get.

In [22]:
#create 5 blank list variable
designation = []
company_name = []
exp = []
location=[]

#for_loop run 10 times
for i in range(1,11):
    #using xpath scrape data thnen uses loop xpath run 10 time or scrape 1st 10 data
    designation.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/a').text)
    company_name.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/div/a[1]').text)
    exp.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/ul/li[1]/span').text)
    location.append(doc.find_element_by_xpath(f'/html/body/div[1]/div[3]/div[2]/section[2]/div[2]/article[{i}]/div[1]/div[1]/ul/li[3]/span').text)
print('successful scrap')

successful scrap

In [23]:
#create data frame using pandas
pd.DataFrame({'Job title':designation,'Company Name':company_name,'Experience required':exp,'Location':location})

,Job title,Company Name,Experience required,Location
0,Senior Data Scientist I,Delhivery,3-7 Yrs,Gurgaon/Gurugram
1,Openings For Jr/mid/Sr level data Scientists,Pluto seven business solutions (p) limited,2-6 Yrs,"Kolkata, Hyderabad/Secunderabad, Pune, Ahmedab..."
2,Data Scientist,Teleperformance,4-9 Yrs,"Gurgaon/Gurugram, Chennai"
3,Data Scientist role,Mount Talent Consulting Private Limited,1-3 Yrs,"Noida, Hyderabad/Secunderabad, Pune, Gurgaon/G..."
4,Data Scientist role,Mount Talent Consulting Private Limited,1-3 Yrs,"Noida, Hyderabad/Secunderabad, Pune, Gurgaon/G..."
5,Urgent Hiring For Data Scientist,Mount Talent Consulting Private Limited,1-6 Yrs,"Gurgaon/Gurugram, Bangalore/Bengaluru"
6,Urgent Hiring For Data Scientist,Mount Talent Consulting Private Limited,1-6 Yrs,"Gurgaon/Gurugram, Bangalore/Bengaluru"
7,Data Analyst / Data Scientist / Business Analy...,GABA Consultancy services,0-0 Yrs,"Noida, New Delhi, Delhi / NCR"
8,Data Scientist,Country Veggie,1-3 Yrs,"Bharuch, Jaipur, Bhopal, Mumbai, Jhansi, Nagpu..."
9,Data Scientist Internship,iHackers Inc,0-1 Yrs,New Delhi

# Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
    1. Brand
    2. Product Description
    3. Price

In [24]:
#create variable and add path chromedrive path
    # doc = Chrome(executable_path='C:\chromedriver.exe')

#upload chrome driver in jupiter notebook then use 
doc = Chrome("chromedriver.exe")
#open webpage
#maximize window
doc.maximize_window()
#open chrome
url = 'https://www.flipkart.com/'
doc.get(url)

In [25]:
#cut page 
time.sleep(4)
doc.find_element_by_xpath('//div[@class="_2QfC02"]//button[@class="_2KpZ6l _2doB4z"]').click()

In [26]:
#using class enter sneakers
doc.find_element_by_class_name('_3704LK').send_keys('sunglasses')
#wait 5sec
time.sleep(2)
#using class click search button 
doc.find_element_by_class_name('L0Z3Pu').click()

In [27]:
#3blank list variable create
brand = []
Product_Description = []
price = []

#create variable store value 11
run = 11
for link in range(1,4):
    #change page url
    doc.get(f'https://www.flipkart.com/search?q=sunglasses&otracker=search&otracker1=search&marketplace=FLIPKART&as-show=on&as=off&page={link}')
    time.sleep(2)
    # loop run 10 times  because element class defind 4*10 1st use 10 time and 4 time
    if link <=3:
        if link ==3:   
            run = 6
        #loop run 10 time but page=3 run only 6 time 
        for i in range(1,run):
            for p in range(1,5):

                brand.append(doc.find_element_by_xpath(f'//div[@class="_1YokD2 _3Mn1Gg"]//div[@class="_1AtVbE col-12-12"][{i}]/div[1]/div[{p}]//div[@class="_2WkVRV"]').text)
                Product_Description.append(doc.find_element_by_xpath(f'//div[@class="_1YokD2 _3Mn1Gg"]//div[@class="_1AtVbE col-12-12"][{i}]/div[1]/div[{p}]//a[@class="IRpwTa"]').text)
                price.append(doc.find_element_by_xpath(f'//div[@class="_1YokD2 _3Mn1Gg"]//div[@class="_1AtVbE col-12-12"][{i}]/div[1]/div[{p}]//div[@class="_30jeq3"]').text)
print('Scrape successfull')

Scrape successfull

In [28]:
#create data frame
pd.DataFrame({'sunglasses brand':brand,'Product Description':Product_Description,'sunglasses Price':price})

,sunglasses brand,Product Description,sunglasses Price
0,VINCENT CHASE,by Lenskart UV Protection Aviator Sunglasses (53),₹999
1,GANSTA,UV Protection Aviator Sunglasses (57),₹269
2,SRPM,UV Protection Wayfarer Sunglasses (56),₹188
3,Elligator,UV Protection Round Sunglasses (54),₹248
4,kingsunglasses,UV Protection Round Sunglasses (54),₹188
...,...,...,...
95,VINCENT CHASE,by Lenskart UV Protection Aviator Sunglasses (53),₹999
96,Urbanic,Others Oval Sunglasses (Free Size),₹675
97,kingsunglasses,UV Protection Round Sunglasses (Free Size),₹279
98,IDEE,"Mirrored, UV Protection Aviator Sunglasses (18)","₹1,229"
99,VINCENT CHASE,"by Lenskart Polarized, UV Protection Aviator S...",₹999

# Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link:
https://www.flipkart.com/apple-iphone-11-black-64-gb-includes-%20earpods-poweradapter/p/itm0f37c2240b217?pid=MOBFKCTSVZAXUHGR&lid=LSTMOBFKC%20TSVZAXUHGREPBFGI&marketplace.
When you will open the above link you will reach to the below shown webpage

In [30]:
#create variable and add path chromedrive path
    # doc = Chrome(executable_path='C:\chromedriver.exe')

#upload chrome driver in jupiter notebook then use 
doc = Chrome("chromedriver.exe")
#open webpage
#maximize window
doc.maximize_window()
#open chrome
url = 'https://www.flipkart.com/apple-iphone-11-black-64-gb-includes-%20earpods-poweradapter/p/itm0f37c2240b217?pid=MOBFKCTSVZAXUHGR&lid=LSTMOBFKC%20TSVZAXUHGREPBFGI&marketplace'
doc.get(url)

In [31]:
#click all reviews
doc.find_element_by_xpath('//div[@class="_3UAT2v _16PBlm"]').click()

In [32]:
#create 3 blank variable:
rating = []
review_summary = []
full_review = []

for i in range(1,11):
    doc.get(f'https://www.flipkart.com/apple-iphone-11-black-64-gb-includes-earpods-power-adapter/product-reviews/itm0f37c2240b217?pid=MOBFKCTSVZAXUHGR&lid=LSTMOBFKCTSVZAXUHGR3IXQLM&marketplace=FLIPKART&page={i}')
    time.sleep(3)
    for i in range(2,12):
        try:
            rating.append(doc.find_element_by_xpath(f'//div[@class="_1AtVbE col-12-12"][{i}]//div[@class="_3LWZlK _1rdVr6 _1BLPMq"]').text)
        except:
            rating.append(doc.find_element_by_xpath(f'//div[@class="_1AtVbE col-12-12"][{i}]//div[@class="_3LWZlK _1BLPMq"]').text)
        finally:
            review_summary.append(doc.find_element_by_xpath(f'//div[@class="_1AtVbE col-12-12"][{i}]//p[@class="_2-N8zT"]').text)
            full_review.append(doc.find_element_by_xpath(f'//div[@class="_1AtVbE col-12-12"][{i}]//div[@class="t-ZTKy"]').text)


print('successful scrap')

successful scrap

In [33]:
#use pandas create daraframe
print('''#######################
#  First 100 reviews  #
#######################''')
pd.DataFrame({'iphone-11 rating':rating,'Review summary':review_summary,'Full review':full_review})

#######################
#  First 100 reviews  #
#######################

,iphone-11 rating,Review summary,Full review
0,5,Brilliant,The Best Phone for the Money\n\nThe iPhone 11 ...
1,5,Simply awesome,Really satisfied with the Product I received.....
2,5,Best in the market!,Great iPhone very snappy experience as apple k...
3,5,Perfect product!,Amazing phone with great cameras and better ba...
4,5,Worth every penny,Previously I was using one plus 3t it was a gr...
...,...,...,...
95,5,Must buy!,Camera is excellent just lack of telephoto mod...
96,5,Terrific purchase,I use a Note10+ and have been using both iOS a...
97,5,Awesome,The phone is completely good\nAs far as camera...
98,3,Decent product,Everything u ll like it when u use this iPhone...
99,5,Wonderful,Nice value for money good and best price I pho...

# Q6: Scrape data for first 100 sneakers you find when you visit flipkart.com andsearch for “sneakers” in the search field.
    You have to scrape 4 attributes of each sneaker:
    1. Brand
    2. Product Description
    3. Price
    As shown in the below image, you have to scrape the tick marked attributes.

In [35]:
#create variable and add path chromedrive path
    # doc = Chrome(executable_path='C:\chromedriver.exe')

#upload chrome driver in jupiter notebook then use 
doc = Chrome("chromedriver.exe")
#open webpage
#maximize window
doc.maximize_window()
#open chrome
url = 'https://www.flipkart.com/'
doc.get(url)

# search  “sneakers”

In [36]:
#cut page 
time.sleep(4)
doc.find_element_by_xpath('//div[@class="_2QfC02"]//button[@class="_2KpZ6l _2doB4z"]').click()

In [37]:
#using class enter sneakers
doc.find_element_by_class_name('_3704LK').send_keys('sneakers')
#wait 5sec
time.sleep(2)
#using class click search button 
doc.find_element_by_class_name('L0Z3Pu').click()

# You have to scrape 4 attributes of each sneaker:
    1. Brand
    2. Product Description
    3. Price

In [38]:
#3blank list variable create
brand = []
Product_Description = []
price = []

#create variable store value 11
run = 11
for link in range(1,4):
    #change page url
    doc.get(f'https://www.flipkart.com/search?q=sneakers&otracker=search&otracker1=search&marketplace=FLIPKART&as-show=on&as=off&page={link}')
    time.sleep(2)
    # loop run 10 times  because element class defind 4*10 1st use 10 time and 4 time
    if link <=3:
        if link ==3:   
            run = 6
        #loop run 10 time but page=3 run only 6 time 
        for i in range(1,run):
            for p in range(1,5):

                brand.append(doc.find_element_by_xpath(f'//div[@class="_1AtVbE col-12-12"][{i}]//div[@class="_13oc-S"]//div[{p}]//div[@class="_1xHGtK _373qXS"]//div[@class="_2WkVRV"]').text)
                Product_Description.append(doc.find_element_by_xpath(f'//div[@class="_1AtVbE col-12-12"][{i}]//div[@class="_13oc-S"]//div[{p}]//div[@class="_2B099V"]').text.split("\n")[1])
                price.append(doc.find_element_by_xpath(f'//div[@class="_1AtVbE col-12-12"][{i}]//div[@class="_13oc-S"]//div[{p}]//div[@class="_30jeq3"]').text)
print('Scrape successfull')

Scrape successfull

In [39]:
#create data frame
pd.DataFrame({'Shoes brand':brand,'Product Description':Product_Description,'Shoes Price':price})

,Shoes brand,Product Description,Shoes Price
0,Strollin,Sneakers For Men,₹489
1,JK PORT,"Fashionable Mens Grey Casual Shoes, Party Wear...",₹489
2,luxury fashion,Luxury Fashionable casual sneaker shoes Sneake...,₹449
3,URBANBOX,Sneakers Sneakers For Men,₹220
4,BRUTON,Modern & Trendy Collection Combo Pack of 02 Sh...,₹447
...,...,...,...
95,NAUTICA,Sneakers For Men,"₹1,899"
96,SPARX,SM-322 Sneakers For Men,₹891
97,HRDK,Sneakers For Men,₹374
98,BIRDE,Trendy Sport Shoes For Men Pack Of 2 Sneakers ...,₹735
99,GIWERO,"Giwero Grand sneakers for Men,Boys Sneakers Fo...","₹1,999"

# Q7: Go to the link - https://www.myntra.com/shoes
Set Price filter to “Rs. 7149 to Rs. 14099 ” , Color filter to “Black”, as shown inthe below image.

In [40]:
#create variable and add path chromedrive path
    # doc = Chrome(executable_path='C:\chromedriver.exe')

#upload chrome driver in jupiter notebook then use 
doc = Chrome("chromedriver.exe")
#open webpage
#maximize window
doc.maximize_window()
#open chrome
url = 'https://www.myntra.com/shoes'
doc.get(url)

# Set Price filter to “Rs. 7149 to Rs. 14099 ” , Color filter to “Black”, as shown inthe below image.

In [46]:
#click color filter using xpath 
doc.find_element_by_xpath('/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[6]/ul/li[1]/label').click()
time.sleep(5)

In [47]:
#click price filter using xpath
doc.find_element_by_xpath('/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[5]/ul/li[2]/label').click()

# And then scrape First 100 shoes data you get. The data should include “Brand” of the shoes , Short Shoe description, price of the shoe as shown in the below image.

In [51]:
#create 3 blank list variable 
brand_name = []
description = []
price = []

#this for_loop run 2 time 1 page data only  50 shoes data
for p in range(2):
    if p == 1:
        doc.find_element_by_xpath('//li[@class="pagination-next"]//a').click()#click next page button
        time.sleep(5)
    else:
        pass
    for i in range(1,51):
        #using x path scrape data
        brand_name.append(doc.find_element_by_xpath(f'//ul[@class="results-base"]//li[{i}]//h3').text)
        description.append(doc.find_element_by_xpath(f'//ul[@class="results-base"]//li[{i}]//h4').text)
        price.append(doc.find_element_by_xpath(f'//ul[@class="results-base"]//li[{i}]//div[@class="product-price"]//span[1]').text.split('Rs. ')[1])
        #if condition use after 50 data scraping click next page button 
        
print('successful scrap')

successful scrap

In [52]:
#all data in  dataframe using pandas
pd.DataFrame({'Shoes Brand':brand_name,'Shoe description':description,'Shoes Price':price})

       Shoes Brand                 Shoe description Shoes Price
0             Puma                Men Running Shoes        8449
1             Puma        Men Magnify Nitro Running        8449
2          Saint G       Women Leather Heeled Boots       13410
3      RARE RABBIT           Men Leather Flat Boots        7999
4          Nautica      High-Top Block Heeled Boots        8699
..             ...                              ...         ...
95            ECCO  Women Textured Leather Sneakers       13999
96            ECCO           Women Ballerinas Flats        8999
97    Calvin Klein         Men Solid Suede Sneakers        7999
98  Tommy Hilfiger         Men Lightweight Sneakers        7999
99           MANGO     Textured High-Top Flat Boots        7990

[100 rows x 3 columns]

# Q8: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon

In [114]:
#create variable and add path chromedrive path
    # doc = Chrome(executable_path='C:\chromedriver.exe')

#upload chrome driver in jupiter notebook then use 
doc = Chrome("chromedriver.exe")
#open webpage
#maximize window
doc.maximize_window()
#open chrome
url = 'https://www.amazon.in/'
doc.get(url)

# Enter “Laptop” in the search field and then click the search icon.

In [115]:
#using id enter laptop in search box
doc.find_element_by_id('twotabsearchtextbox').send_keys('Laptop')
#click search button
doc.find_element_by_id('nav-search-submit-button').click()
try:
    doc.find_element_by_xpath('//div[@id="filter-p_n_feature_thirteen_browse-bin"]//a[@id="p_n_feature_thirteen_browse-bin/16757431031"]').click()
except:
    doc.find_element_by_xpath('//div[@id="filters"]//li[11]//span["a-size-base a-color-base"]').click()

# scrape first 10 Intel Core i7 laptops data. scrape 3 attributesfor each laptop:
    1. Title
    2. Ratings
    3. Price

# first 10 Intel Core i7 laptops

In [123]:
#locating Ratings
urls=doc.find_elements_by_xpath("//a[@class='a-link-normal s-link-style a-text-normal']")#collecting urls of all the laptop
UR = []#blank list variable
rating =[]#blank list variable
title = []
price = []
#loop run for 10 times
for i in urls[:10]:
    UR.append(i.get_attribute('href'))
    
for url in UR:##loop for every laptop in the list
    doc.get(url)
    try:
        ##appending the ratings in Ratings list
        rating.append(doc.find_element_by_xpath("//span[@class='a-size-base a-nowrap']//span").text.split("out of")[0])
    except:
        ##appending rating not show
        rating.append("rating not show")
    finally:
        title.append(doc.find_element_by_id('productTitle').text)
        try:
            price.append(doc.find_element_by_xpath('//table[@class="a-lineitem a-align-top"]//td[@class="a-span12"]').text)
        except:
            try:
                price.append(doc.find_element_by_class_name('a-price-whole').text)
            except:
                price.append('price not show')
            
            
print('successful scrap')

successful scrap

In [124]:
#create data frame using pandas 
print('''######################################
#   first 10 Intel Core i7 laptops   #
######################################''')
pd.DataFrame({'Title':title,'Price':price,'Rating':rating})

######################################
#   first 10 Intel Core i7 laptops   #
######################################

,Title,Price,Rating
0,Acer Nitro 5 AN515-57 Gaming Laptop | Intel Co...,"₹89,990.00",4.6
1,Lenovo ThinkBook Yoga 14s Intel Core i7 11th G...,"₹86,990.00",4.2
2,Acer Nitro 5 AN515-57 Gaming Laptop | Intel Co...,"₹89,990.00",4.6
3,"ASUS VivoBook 14 (2021), 14-inch (35.56 cms) F...","₹59,990.00",rating not show
4,ASUS TUF Gaming F15 (2021) 15.6-inch (39.62 cm...,"₹96,990.00",3.9
5,"HP Pavilion 14, Intel 11th Gen Core i7 16GB RA...","66,999",4.4
6,Lenovo ThinkBook 13s Intel 11th Gen Core i7 13...,"₹79,990.00",4.3
7,ASUS TUF Gaming F15 (2021) 15.6-inch (39.62 cm...,"₹1,14,990.00",4.8
8,"ASUS TUF Dash F15 (2021), 15.6-inch (39.62 cms...","₹82,990.00",4
9,Lenovo ThinkBook 15 Intel 11th Gen Core i7 15....,"₹85,990.00",4.4

# first 10 Intel Core i9 laptops

In [111]:

url = 'https://www.amazon.in/'
doc.get(url)
time.sleep(3)
#using id enter laptop in search box
doc.find_element_by_id('twotabsearchtextbox').send_keys('Laptop')
time.sleep(1)
#click search button
doc.find_element_by_id('nav-search-submit-button').click()
#click intel core i9
time.sleep(3)
doc.find_element_by_xpath('/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/span/div/div/div[5]/ul[2]/li[12]/span/a/span').click()

In [112]:
#locating Ratings
urls=doc.find_elements_by_xpath("//a[@class='a-link-normal s-link-style a-text-normal']")#collecting urls of all the laptop
UR = []#blank list variable
rating =[]#blank list variable
title = []
price = []
#loop run for 10 times
for i in urls[:10]:
    UR.append(i.get_attribute('href'))
    
for url in UR:##loop for every laptop in the list
    doc.get(url)
    try:
        ##appending the ratings in Ratings list
        rating.append(doc.find_element_by_xpath("//span[@class='a-size-base a-nowrap']//span").text.split("out of")[0])
    except:
        ##appending rating not show
        rating.append("rating not show")
    finally:
        title.append(doc.find_element_by_id('productTitle').text)
        try:
            price.append(doc.find_element_by_xpath('//div[@id="newAccordionRow"]//h5').text.split('   ')[1])
        except:
            try:
                price.append(doc.find_element_by_class_name('a-price-whole').text)
            except:
                price.append('price not show')
            
            
print('successful scrap')

successful scrap

In [113]:
#create data frame using pandas 
print('''######################################
#   first 10 Intel Core i9 laptops   #
######################################''')
pd.DataFrame({'Title':title,'Price':price,'Rating':rating})

######################################
#   first 10 Intel Core i9 laptops   #
######################################

,Title,Price,Rating
0,"ASUS TUF Gaming F15 (2021), 15.6"" (39.62 cms) ...","144,990.00",4.1
1,"ASUS TUF Gaming F15 (2021), 15.6-inch (39.62 c...","143,990.00",4
2,Lenovo Legion 7 10th Gen Intel Core i9 15.6 in...,"2,65,999",4.4
3,Dell XPS 17 (2021) i9-11900H Touch Screen Lapt...,"3,25,500",rating not show
4,Dell Precision 5550 || i9 -10885H || 16GB || 1...,"200,000.00",rating not show
5,Dell G7 7500 15.6inch FHD 300 Hz Display Gamin...,"205,990.00",4.1
6,"ASUS TUF Gaming F15 (2021), 15.6-inch (39.62 c...","139,990.00",5
7,(Renewed) Dell G7 7500 15.6inch FHD 300 Hz Dis...,"2,05,990",rating not show
8,Z2 G5 Workstation 700W /Core i9-10900 (2.8GHz ...,"2,39,000",rating not show

# Q9: Write a python program to scrape data for first 10 job results for Data Scientist Designation in Noidalocation. You have to scrape company name, No. of days ago when job was posted, Rating of the company.
    This task will be done in following steps:
    1. First get the webpage https://www.ambitionbox.com/
    2. Click on the Job option as shown in the image
    3. After reaching to the next webpage, In place of “Search by Designations, Companies, Skills” enter
    “Data Scientist” and click on search button.
    4. You will reach to the following web page click on location and in place of “Search location” enter
    “Noida” and select location “Noida”.
    5. Then scrape the data for the first 10 jobs results you get on the above shown page.
    6. Finally create a dataframe of the scraped data.

In [94]:
#create variable and add path chromedrive path
    # doc = Chrome(executable_path='C:\chromedriver.exe')

#upload chrome driver in jupiter notebook then use 
doc = Chrome("chromedriver.exe")
#open webpage
#maximize window
doc.maximize_window()
#open chrome
url = 'https://www.ambitionbox.com/'
doc.get(url)

# 2. Click on the Job option as shown in the image

In [95]:
#click salaries button using css_selector
doc.find_element_by_css_selector('a[title="Jobs"]').click()

# 3. After reaching to the next webpage, In place of “Search by Designations, Companies, Skills” enter“Data Scientist” and click on search button.

In [97]:
#enter Data Scientist using css selecter then add data scientist
doc.find_element_by_css_selector('input[title="Enter Designation, Company or a Skill"]').send_keys('Data Scientist')

In [98]:
#click search button using class_name
doc.find_element_by_class_name('ctas-btn-medium').click()

# 4. You will reach to the following web page click on location and in place of “Search location” enter “Noida” and select location “Noida”.

In [99]:

#click location button using css selector
doc.find_element_by_css_selector('div[title="Location"]').click()

In [100]:
#Enter noida in search box
doc.find_element_by_xpath('/html/body/div/div/div/div[2]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[2]/input').send_keys('Noida')

In [101]:
#select noida in list
doc.find_element_by_xpath('/html/body/div/div/div/div[2]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[3]/div[1]/div[1]/div/label').click()

# 5. Then scrape the data for the first 10 jobs results you get on the above shown page.

In [102]:
#create 6 blank list variable
company_name = []
job_posted = []
Rating = []

#for _loop run 10 times
for i in range(1,11):
    #     using xpath extract text then text append 10 time into list 
    company_name.append(doc.find_element_by_xpath(f'/html/body/div/div/div/div[2]/div[2]/div[2]/div[2]/div/div[1]/div[{i}]/div[2]/div/p').text)
    job_posted.append(doc.find_element_by_xpath(f'/html/body/div/div/div/div[2]/div[2]/div[2]/div[2]/div/div[1]/div[{i}]/div[3]/span[1]').text)
    Rating.append(doc.find_element_by_xpath(f'/html/body/div/div/div/div[2]/div[2]/div[2]/div[2]/div/div[1]/div[{i}]/div[2]/div/div/a[1]/span').text)

print('successful scrap')

successful scrap

In [103]:
# using pandas create dataframe
pd.DataFrame({'Company Name':company_name,'job was posted':job_posted,'Rating':Rating})

                                 Company Name job was posted Rating
0  Nokia Solutions and Networks India (P)Ltd.         7d ago    4.3
1              LG Electronics India Pvt. Ltd.        28d ago    4.1
2                                       Paytm       23hr ago    3.7
3                  Jubilant Foodworks Limited        18d ago    3.9
4                                CHT Sapiense         2d ago    3.7
5                                CHT Sapiense         3d ago    3.7
6                                    GI Group        14d ago    4.1
7                                    GI Group        14d ago    4.1
8                                    GI Group        14d ago    4.1
9                                       Paytm        22d ago    3.7

# Q10: Write a python program to scrape the salary data for Data Scientist designation.
    You have to scrape Company name, Number of salaries, Average salary, Minsalary, Max Salary.
    The above task will be, done as shown in the below steps:
    1. First get the webpage https://www.ambitionbox.com/
    2. Click on the salaries option as shown in the image.
    3. After reaching to the following webpage, In place of “Search Job Profile” enters “Data Scientist” and
    then click on “Data Scientist”.
    4. Scrape the data for the first 10 companies. Scrape the company name, total salary record, average
    salary, minimum salary, maximum salary, experience required.
    5. Store the data in a dataframe.

# 1. First get the webpage https://www.ambitionbox.com/1

In [104]:
#create variable and add path chromedrive path
    # doc = Chrome(executable_path='C:\chromedriver.exe')

#upload chrome driver in jupiter notebook then use 
doc = Chrome("chromedriver.exe")
#open webpage
#maximize window
doc.maximize_window()
#open chrome
url = 'https://www.ambitionbox.com/'
doc.get(url)

# 2. Click on the salaries option as shown in the image.

In [105]:
#click salaries button using css_selector
doc.find_element_by_css_selector('a[title="Company Salaries"]').click()

# 3. After reaching to the following webpage, In place of “Search Job Profile” enters “Data Scientist” and then click on “Data Scientist”.

In [106]:
#Enter "Data Scientist" using id
enter_data = doc.find_element_by_id("jobProfileSearchbox")

In [107]:
enter_data.send_keys('Data Scientist')#enter Data Scientist

In [108]:
#click data scientis
doc.find_element_by_class_name('tt_text').click()

# 4. Scrape the data for the first 10 companies. Scrape the company name, total salary record, average salary, minimum salary, maximum salary, experience required.

In [110]:
#create 6 blank list variable 
company_name = []
salary_record = []
average_salary = []
minimum_salary = []
maximum_salary = []
experience_required = []

#for_loop run 10 times
for i in range(1,11):
#     using xpath extract text then text append 10 time into list 
    company_name.append(doc.find_element_by_xpath(f'/html/body/div/div/div/main/section[1]/div[2]/div[3]/div[2]/div[{i}]/div[1]/div/div/div[1]/a').text)
    salary_record.append(doc.find_element_by_xpath(f'/html/body/div/div/div/main/section[1]/div[2]/div[3]/div[2]/div[{i}]/div[1]/div/div/div[1]/span').text)
    average_salary.append(doc.find_element_by_xpath(f'/html/body/div/div/div/main/section[1]/div[2]/div[3]/div[2]/div[{i}]/div[2]/div/div[1]/div/p').text)
    minimum_salary.append(doc.find_element_by_xpath(f'/html/body/div/div/div/main/section[1]/div[2]/div[3]/div[2]/div[{i}]/div[2]/div/div[2]/div[1]').text)
    maximum_salary.append(doc.find_element_by_xpath(f'/html/body/div/div/div/main/section[1]/div[2]/div[3]/div[2]/div[{i}]/div[2]/div/div[2]/div[2]').text)
    experience_required.append(doc.find_element_by_xpath(f'/html/body/div/div/div/main/section[1]/div[2]/div[3]/div[2]/div[{i}]/div[1]/div/div/div[2]').text.split('\n')[2])
    
print('successful scrap')

successful scrap

# 5. Store the data in a dataframe.

In [111]:
# using pandas create dataframe
pd.DataFrame({'Company Name':company_name,'Salary Record':salary_record,'Average Salary':average_salary,'Minimum Salary':minimum_salary,'Maximum Salary':maximum_salary,'Experience Required':experience_required})

,Company Name,Salary Record,Average Salary,Minimum Salary,Maximum Salary,Experience Required
0,Walmart,based on 10 salaries,₹ 28.7L,₹ 17.7L,₹ 35.0L,3 yrs exp
1,Ab Inbev,based on 22 salaries,₹ 19.5L,₹ 15.0L,₹ 25.0L,3-4 yrs exp
2,ZS,based on 14 salaries,₹ 15.8L,₹ 9.8L,₹ 20.0L,2 yrs exp
3,Fractal Analytics,based on 72 salaries,₹ 15.0L,₹ 9.5L,₹ 22.0L,2-4 yrs exp
4,Optum,based on 23 salaries,₹ 15.0L,₹ 11.0L,₹ 21.3L,3-4 yrs exp
5,UnitedHealth,based on 49 salaries,₹ 13.5L,₹ 7.2L,₹ 20.5L,2-4 yrs exp
6,Tiger Analytics,based on 27 salaries,₹ 13.5L,₹ 8.3L,₹ 18.5L,3-4 yrs exp
7,Verizon,based on 14 salaries,₹ 12.7L,₹ 10.0L,₹ 21.0L,4 yrs exp
8,Ganit Business Solutions,based on 13 salaries,₹ 12.4L,₹ 8.5L,₹ 15.0L,4 yrs exp
9,Ericsson,based on 42 salaries,₹ 11.9L,₹ 5.8L,₹ 21.5L,3-4 yrs exp